Autodesk.Revit.DB.Structure.RebarWorkInstructions
Dictates how shape matching works for bars that are bent vs bars that are straight

Autodesk.Revit.DB.Structure.RebarWorkInstructions.Straight
the bar is shipped straight and bent on site

Autodesk.Revit.DB.Structure.RebarWorkInstructions.Bent
the bar is bent in the shop